openfoam/segment_test/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    xmin
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    xmax
    {
        type            zeroGradient;
    }

    ymin
    {
        type            zeroGradient;
    }

    ymax
    {
        type            zeroGradient;
    }

    zmin
    {
        type            zeroGradient;
    }

    zmax
    {
        type            zeroGradient;
    }

    artery
    {
        type            noSlip;
    }
}