openfoam/segment_test/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xmin
    {
        type            zeroGradient;
    }

    xmax
    {
        type            fixedValue;
        value           uniform 0;
    }

    ymin
    {
        type            zeroGradient;
    }

    ymax
    {
        type            zeroGradient;
    }

    zmin
    {
        type            zeroGradient;
    }

    zmax
    {
        type            zeroGradient;
    }

    artery
    {
        type            zeroGradient;
    }
}