openfoam/segment_test/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM
|  \\    /   O peration     |
|   \\  /    A nd           |
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

viscosityModel constant;

nu              0.0035;