openfoam/segment_test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  -45 -15)
    (20 -45 -15)
    (20  -5 -15)
    (0   -5 -15)

    (0  -45   5)
    (20 -45   5)
    (20  -5   5)
    (0   -5   5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (60 60 60)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xmin
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    xmax
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    ymin
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }

    ymax
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    zmin
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    zmax
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);