openfoam/segment_test/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pipe
{
    surfaces
    (
        "pipe.obj"
    );

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle           150;

    // Do not mark region edges
    geometricTestOnly       yes;

    writeObj                yes;
    verboseObj              yes;
}

pipeWall
{
    surfaces
    (
        "pipeWall.obj"
    );

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle           150;

    closeness
    {
        // Output the closeness of surface points to other surface elements.
        pointCloseness          yes;
    }

    writeVTK                yes;
}

// ************************************************************************* //
